---
kind: method
id: M:Autodesk.Revit.DB.FillGrid.IsEqual(Autodesk.Revit.DB.FillGrid)
source: html/27963982-e0e8-4b64-af77-112bca45179a.htm
---
# Autodesk.Revit.DB.FillGrid.IsEqual Method

Check if two fill grids are equal.

## Syntax (C#)
```csharp
public bool IsEqual(
	FillGrid other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.FillGrid`) - The fill grid to be compared.

## Returns
True if the two fill grids are equal, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null